In [99]:
import pandas as pd
import numpy as np
from sqlalchemy.dialects.mssql.information_schema import columns

## Series

In [100]:
obj=pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [101]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [102]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [103]:
obj2=pd.Series([4, 7, -5, 3],index=["a","b","c","d"])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [104]:
obj2["a"]

np.int64(4)

In [105]:
obj2[["c","a","b"]]

c   -5
a    4
b    7
dtype: int64

In [106]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [107]:
obj2*2

a     8
b    14
c   -10
d     6
dtype: int64

In [108]:
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.006738
d      20.085537
dtype: float64

In [109]:
"b" in obj2,"e" in obj2

(True, False)

In [110]:
sdata={"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3=pd.Series(sdata) # converting python dictionary to a Series
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [111]:
obj3.to_dict() # converting series to a python dictionary

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [112]:
states=["California", "Ohio", "Oregon", "Texas"]
obj4=pd.Series(sdata,index=states)
obj4
# Here, three values found in sdata were placed in the appropriate locations, but since no value for "California" was found, it appears as NaN (Not a Number), which is considered in pandas to mark missing or NA values. Since "Utah" was not included in states, it is excluded from the resulting object.

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [113]:
pd.isna(obj4),pd.notna(obj4) # The isna and notna functions in pandas should be used to detect missing data

(California     True
 Ohio          False
 Oregon        False
 Texas         False
 dtype: bool,
 California    False
 Ohio           True
 Oregon         True
 Texas          True
 dtype: bool)

In [114]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [115]:
obj3,obj4

(Ohio      35000
 Texas     71000
 Oregon    16000
 Utah       5000
 dtype: int64,
 California        NaN
 Ohio          35000.0
 Oregon        16000.0
 Texas         71000.0
 dtype: float64)

In [116]:
(obj3+obj4)

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [117]:
obj4.name="Population"
obj4.index.name="state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [118]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [119]:
obj.index=["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

A DataFrame represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type (numeric, string, Boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index.

In [120]:
data={"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],"year":[2000, 2001, 2002, 2001, 2002, 2003],
      "pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [121]:
frame.head() # the head method selects only the first five rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [122]:
frame.tail() # tail returns the last five rows

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [123]:
pd.DataFrame(data,columns=["year","state","pop"]) # specify a sequence of columns, the DataFrame’s columns will be arranged in that order

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [124]:
pd.DataFrame(data,columns=["year", "state", "pop", "debt"])

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [125]:
frame["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [126]:
frame.loc[1],frame.iloc[2] # Rows can also be retrieved by position or name with the special iloc and loc attributes

(state    Ohio
 year     2001
 pop       1.7
 Name: 1, dtype: object,
 state    Ohio
 year     2002
 pop       3.6
 Name: 2, dtype: object)

In [127]:
frame["debt"]=16.5
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [128]:
frame["debt"]=np.arange(6.)
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2    Ohio  2002  3.6   2.0
3  Nevada  2001  2.4   3.0
4  Nevada  2002  2.9   4.0
5  Nevada  2003  3.2   5.0

In [129]:
val=pd.Series([-1.2, -1.5, -1.7],index=["two", "four", "five"])
frame["debt"]=val
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9   NaN
5  Nevada  2003  3.2   NaN

In [130]:
frame["eastern"]=frame["state"]=="Ohio"
frame,frame.columns

(    state  year  pop  debt  eastern
 0    Ohio  2000  1.5   NaN     True
 1    Ohio  2001  1.7   NaN     True
 2    Ohio  2002  3.6   NaN     True
 3  Nevada  2001  2.4   NaN    False
 4  Nevada  2002  2.9   NaN    False
 5  Nevada  2003  3.2   NaN    False,
 Index(['state', 'year', 'pop', 'debt', 'eastern'], dtype='object'))

In [131]:
del frame["eastern"]
frame.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

In [132]:
populations={"Ohio":{2000:1.5,2001: 1.7, 2002: 3.6},
             "Nevada":{2001: 2.4, 2002: 2.9}}
frame2=pd.DataFrame(populations)
frame2

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [133]:
frame2.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [134]:
pd.DataFrame(populations,index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [135]:
pdata={"Ohio":frame2["Ohio"][:-1],
       "Nevada":frame2["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [136]:
frame2

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [137]:
frame2.index.name="year"
frame2.columns.name="state"
frame2

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [138]:
frame2.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [139]:
frame.to_numpy()

array([['Ohio', 2000, 1.5, nan],
       ['Ohio', 2001, 1.7, nan],
       ['Ohio', 2002, 3.6, nan],
       ['Nevada', 2001, 2.4, nan],
       ['Nevada', 2002, 2.9, nan],
       ['Nevada', 2003, 3.2, nan]], dtype=object)

### Index Objects

In [140]:
obj=pd.Series(np.arange(3),index=["a","b","c"])
index=obj.index
index,index[1:] # Index objects are immutable and thus can’t be modified by the user:

(Index(['a', 'b', 'c'], dtype='object'), Index(['b', 'c'], dtype='object'))

In [141]:
labels=pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [142]:
obj2=pd.Series([1.5,-2.5,0],index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [143]:
obj2.index is labels

True

In [144]:
frame2

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [145]:
frame2.columns,"Ohio" in frame2,2003 in frame2.index

(Index(['Ohio', 'Nevada'], dtype='object', name='state'), True, False)

In [146]:
pd.Index(["foo", "foo", "bar", "bar"]) # Unlike Python sets, a pandas Index can contain duplicate labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [147]:
labels1=pd.Index(np.arange(5))
labels1

Index([0, 1, 2, 3, 4], dtype='int64')

In [148]:
labels1.append(labels) # Concatenate with additional Index objects, producing a new Index

Index([0, 1, 2, 3, 4, 0, 1, 2], dtype='int64')

In [149]:
labels1.difference(labels) # Compute set difference as an Index

Index([3, 4], dtype='int64')

In [150]:
labels1.intersection(labels) # Compute set intersection

Index([0, 1, 2], dtype='int64')

In [151]:
labels1.union(labels) # Compute set union

Index([0, 1, 2, 3, 4], dtype='int64')

## Essential Functionality

In [152]:
obj=pd.Series([4.5, 7.2, -5.3, 3.6],index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [153]:
obj2=obj.reindex(["a","b","c","d","e"]) # Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [154]:
obj3=pd.Series(["blue", "purple", "yellow"],index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [155]:
obj3.reindex(np.arange(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [156]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=["a","b","c"],columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [157]:
frame5=pd.DataFrame(np.arange(9).reshape(3,3),index=["a","b","c"],columns=["one","two","three"])
frame5

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8

In [158]:
frame5[["three","two","one"]]

   three  two  one
a      2    1    0
b      5    4    3
c      8    7    6

In [159]:
frame5.reindex(index=["c","b","a"])
label4=["AAA","BBB","CCC"]
frame5.reindex(columns=label4)

   AAA  BBB  CCC
a  NaN  NaN  NaN
b  NaN  NaN  NaN
c  NaN  NaN  NaN

In [160]:
frame2=frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [161]:
states=["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [162]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [163]:
frame.loc[["a", "b", "c"],["California", "Texas"]]

   California  Texas
a           2      1
b           5      4
c           8      7

### Dropping Entries from an Axis

In [164]:
obj=pd.Series(np.arange(5.),index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [165]:
new_obj=obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [166]:
obj.drop(["b","c"])

a    0.0
d    3.0
e    4.0
dtype: float64

In [167]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=["Ohio", "Colorado", "Utah", "New York"],columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [169]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [170]:
data.drop("two",axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### Indexing, Selection, and Filtering

In [171]:
obj=pd.Series(np.arange(4.),index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [172]:
obj["b"],obj[2:4],obj[["b","c","d"]]

(np.float64(1.0),
 c    2.0
 d    3.0
 dtype: float64,
 b    1.0
 c    2.0
 d    3.0
 dtype: float64)

In [173]:
obj[[1,3]]

C:\Users\thami\AppData\Local\Temp\ipykernel_1432\449450303.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [174]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [175]:
obj.loc["a"],obj.loc[["a","b"]]

(np.float64(0.0),
 a    0.0
 b    1.0
 dtype: float64)

In [176]:
obj1=pd.Series([1,2,3],index=[2, 0, 1])
obj2=pd.Series([1,2,3],index=["a","b","c"])

In [177]:
obj1,print("\n"),obj2

(2    1
 0    2
 1    3
 dtype: int64,
 None,
 a    1
 b    2
 c    3
 dtype: int64)

In [178]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [179]:
obj1.iloc[[0,1,2]],obj2.iloc[[0,1,2]]

(2    1
 0    2
 1    3
 dtype: int64,
 a    1
 b    2
 c    3
 dtype: int64)

In [180]:
obj2.loc["b":"c"],obj2[["b","c"]]

(b    2
 c    3
 dtype: int64,
 b    2
 c    3
 dtype: int64)

In [181]:
obj2.loc["b":"c"]=5
obj2

a    1
b    5
c    5
dtype: int64

In [182]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=["Ohio", "Colorado", "Utah", "New York"],columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [183]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [184]:
data.drop(columns="two")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [185]:
data[["three","one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [186]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [187]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [188]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [189]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [190]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [191]:
data.loc["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [192]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [193]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [194]:
data.loc[data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [195]:
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [196]:
ser2=pd.Series(np.arange(3.0),index=["a","b","c"])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [197]:
ser2[-1]

C:\Users\thami\AppData\Local\Temp\ipykernel_1432\2869701431.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

np.float64(2.0)

In [198]:
ser.iloc[-1]

np.float64(2.0)

In [199]:
data.loc[:,"one"]=1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [200]:
data.iloc[2]=5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [201]:
data.loc[data["four"]>5]=3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [202]:
data.loc[data.three==5,'three']=6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

## Arithmetic and Data Alignment

In [203]:
s1=pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2=pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=["a", "c", "e", "f", "g"])
s1,s2

(a    7.3
 c   -2.5
 d    3.4
 e    1.5
 dtype: float64,
 a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [204]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [205]:
df1=pd.DataFrame(np.arange(9).reshape(3,3),columns=list("bcd"),index=["Ohio", "Texas", "Colorado"])
df2=pd.DataFrame(np.arange(12.).reshape(4,3),columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])

In [206]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [207]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [208]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [209]:
df1=pd.DataFrame(np.arange(12.).reshape(3,4),columns=list("abcd"))
df2=pd.DataFrame(np.arange(20.0).reshape(4,5),columns=list("abcde"))
df1,df2

(     a    b     c     d
 0  0.0  1.0   2.0   3.0
 1  4.0  5.0   6.0   7.0
 2  8.0  9.0  10.0  11.0,
       a     b     c     d     e
 0   0.0   1.0   2.0   3.0   4.0
 1   5.0   6.0   7.0   8.0   9.0
 2  10.0  11.0  12.0  13.0  14.0
 3  15.0  16.0  17.0  18.0  19.0)

In [210]:
df2.loc[1,"b"]=np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [211]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [212]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [213]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [214]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [215]:
df2.iloc[-1]

a    15.0
b    16.0
c    17.0
d    18.0
e    19.0
Name: 3, dtype: float64

In [216]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [217]:
arr=np.arange(12.0).reshape(3,4)
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [218]:
arr[0]

array([0., 1., 2., 3.])

In [219]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [220]:
frame=pd.DataFrame(np.arange(12.).reshape(4,3),columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [221]:
series=frame.iloc[0]

In [222]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [223]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [224]:
series2=pd.Series(np.arange(3.),index=["b", "e", "f"])
series2

b    0.0
e    1.0
f    2.0
dtype: float64

In [225]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [226]:
series3=frame["d"]
frame,series3

(          b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0,
 Utah       1.0
 Ohio       4.0
 Texas      7.0
 Oregon    10.0
 Name: d, dtype: float64)

In [227]:
frame.sub(series3,axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [228]:
frame.add(series3,axis="index")

           b     d     e
Utah     1.0   2.0   3.0
Ohio     7.0   8.0   9.0
Texas   13.0  14.0  15.0
Oregon  19.0  20.0  21.0

### Function Application and Mapping

In [229]:
frame=pd.DataFrame(np.random.standard_normal((4,3)),columns=list("bde"),index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    0.161343 -0.213106 -0.124410
Ohio   -0.416360 -0.414493 -1.826456
Texas   0.121113 -0.344964  1.220164
Oregon -0.772501  1.052646  0.819071

In [230]:
frame=frame.abs()
frame

               b         d         e
Utah    0.161343  0.213106  0.124410
Ohio    0.416360  0.414493  1.826456
Texas   0.121113  0.344964  1.220164
Oregon  0.772501  1.052646  0.819071

In [231]:
def f(x):
    return x.max() - x.min()

frame.apply(f)

b    0.651388
d    0.839540
e    1.702046
dtype: float64

In [232]:
def my_format(x):
    return f"{x:.2f}"

new_frame=frame.applymap(my_format)
new_frame

C:\Users\thami\AppData\Local\Temp\ipykernel_1432\664947030.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  new_frame=frame.applymap(my_format)

           b     d     e
Utah    0.16  0.21  0.12
Ohio    0.42  0.41  1.83
Texas   0.12  0.34  1.22
Oregon  0.77  1.05  0.82

In [233]:
frame["e"].map(my_format)

Utah      0.12
Ohio      1.83
Texas     1.22
Oregon    0.82
Name: e, dtype: object

### Sorting and Ranking

In [234]:
obj=pd.Series(np.arange(4),index=list("dacb"))
obj

d    0
a    1
c    2
b    3
dtype: int64

In [235]:
obj.sort_index()

a    1
b    3
c    2
d    0
dtype: int64

In [236]:
frame=pd.DataFrame(np.arange(8).reshape(2,4),columns=list("dabc"),index=["three", "one"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [237]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [238]:
frame.sort_index(axis="columns").sort_index()

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [239]:
obj=pd.Series([4, 7, -3, 2])

In [240]:
obj.sort_values() # To sort a Series by its values, use its sort_values method:

2   -3
3    2
0    4
1    7
dtype: int64

In [241]:
obj=pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values() # Any missing values are sorted to the end of the Series by default

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [242]:
obj.sort_values(na_position="first") # Missing values can be sorted to the start instead by using the na_position option

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [243]:
frame=pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [244]:
frame.sort_values("b") # When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do so, pass one or more column names to sort_values

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [245]:
frame.sort_values(["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array, starting from the lowest value. The rank methods for Series and DataFrame are the place to look; by default, rank breaks ties by assigning each group the mean rank

In [246]:
obj=pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [247]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [248]:
obj_1=obj.sort_values()

In [249]:
obj_1.rank(method="first")

1    1.0
5    2.0
4    3.0
3    4.0
6    5.0
0    6.0
2    7.0
dtype: float64

In [250]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [251]:
frame=pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],"c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [252]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

Up until now almost all of the examples we have looked at have unique axis labels (index values). While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory. Let’s consider a small Series with duplicate indices

In [253]:
obj=pd.Series(np.arange(5),index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [254]:
obj.index.is_unique # The is_unique property of the index can tell you whether or not its labels are unique

False

In [255]:
obj["a"],obj["c"] # Indexing a label with multiple entries returns a Series, while single entries return a scalar value

(a    0
 a    1
 dtype: int64,
 np.int64(4))

In [256]:
df=pd.DataFrame(np.random.standard_normal((5,3)),index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.343260 -0.874236  0.662133
a -0.783004 -0.734414 -0.489294
b -0.531418  0.946024  0.687867
b -0.574785  2.624381  1.450361
c -1.248468 -1.899909  0.620197

In [257]:
df.loc["b"]

          0         1         2
b -0.531418  0.946024  0.687867
b -0.574785  2.624381  1.450361

In [258]:
df.loc["c"]

0   -1.248468
1   -1.899909
2    0.620197
Name: c, dtype: float64

## Summarizing and Computing Descriptive Statistics

In [259]:
df=pd.DataFrame([[1.4, np.nan],[7.1, -4.5],[np.nan, np.nan],[0.75, -1.3]],
                index=["a", "b", "c", "d"],columns=["one","two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [260]:
df.sum() # Calling DataFrame’s sum method returns a Series containing column sums

one    9.25
two   -5.80
dtype: float64

In [261]:
df.sum(axis="columns") # Passing axis="columns" or axis=1 sums across the columns instead

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [262]:
df.sum(axis="index",skipna=False)

one   NaN
two   NaN
dtype: float64

In [263]:
df.mean() # down the columns

one    3.083333
two   -2.900000
dtype: float64

In [264]:
df.mean(axis="columns")  # across the columns

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [265]:
df.mean(axis="index")

one    3.083333
two   -2.900000
dtype: float64

In [266]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

# Chapter 6. Data Loading, Storage, and File Formats

In [267]:
df=pd.read_csv("examples/ex1.csv")

In [268]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [269]:
df1=pd.read_csv("examples/ex2.csv")
df1

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [270]:
pd.read_csv("examples/ex2.csv",header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [271]:
pd.read_csv("examples/ex2.csv",names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [272]:
# Suppose you wanted the message column to be the index of the returned DataFrame. You can either indicate you want the column at index 4 or named "message" using the index_col argument

names=["a", "b", "c", "d", "message"]
pd.read_csv("examples/ex2.csv",names=names,index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [273]:
pd.read_csv("examples/csv_mindex.csv")

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [274]:
parsed=pd.read_csv("examples/csv_mindex.csv",index_col=["key1","key2"])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [275]:
pd.read_csv("examples/ex3.txt")

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [276]:
result=pd.read_csv("examples/ex3.txt",sep="\s+")
result

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\thami\AppData\Local\Temp\ipykernel_1432\2821965484.py:1: SyntaxWarning: invalid escape sequence '\s'
  result=pd.read_csv("examples/ex3.txt",sep="\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [277]:
pd.read_csv("examples/ex4.csv")

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [278]:
pd.read_csv("examples/ex4.csv",skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [279]:
result=pd.read_csv("examples/ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [280]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [281]:
result=pd.read_csv("examples/ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [282]:
result2=pd.read_csv("examples/ex5.csv",keep_default_na=False)
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [283]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [284]:
result3=pd.read_csv("examples/ex5.csv",keep_default_na=False,na_values=["NA"])
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [285]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [286]:
values={"message":["foo","NA"],"something":["two"]}
pd.read_csv("examples/ex5.csv",keep_default_na=False,na_values=values)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

### Reading Text Files in Pieces

In [287]:
pd.options.display.max_rows=10

In [288]:
result=pd.read_csv("examples/ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [289]:
result.head()

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [290]:
result.tail()

           one       two     three      four key
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

In [292]:
pd.read_csv("examples/ex6.csv",nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [293]:
chunker=pd.read_csv("examples/ex6.csv",chunksize=1000)

In [294]:
tot=pd.Series([],dtype='int64')
for piece in chunker:
    tot=tot.add(piece["key"].value_counts(),fill_value=0) # The value_counts() function in pandas is used to count the frequency of unique values in a Series (i.e., one column)


tot =tot.sort_values(ascending=False)

In [295]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing Data to Text Format

In [296]:
data=pd.read_csv("examples/ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [297]:
data.to_csv("examples/out.csv")

In [298]:
pd.read_csv("examples/out.csv")

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [299]:
# Other delimiters can be used, of course (writing to sys.stdout so it prints the text result to the console rather than a file)
import sys
data.to_csv(sys.stdout,sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [300]:
data.to_csv(sys.stdout,na_rep="NULL") # Missing values appear as empty strings in the output. You might want to denote them by some other sentinel value

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [301]:
# With no other options specified, both the row and column labels are written. Both of these can be disabled
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [302]:
# You can also write only a subset of the columns, and in an order of your choosing
data.to_csv(sys.stdout,index=False,columns=["a","b","c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### JSON Data

In [303]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [305]:
import json # To convert a JSON string to Python form, use json.loads
result=json.loads(obj)

In [306]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [308]:
# json.dumps, on the other hand, converts a Python object back to JSON
asjson=json.dumps(result)

In [309]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [310]:
siblings=pd.DataFrame(result["siblings"],columns=["name","age"])

In [311]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [312]:
data=pd.read_json("examples/example.json")
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [314]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

### XML and HTML: Web Scraping

In [315]:
tables=pd.read_html("examples/fdic_failed_bank_list.html")
len(tables)

1

In [317]:
failures=tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

## Binary Data Formats

In [319]:
frame=pd.read_csv("examples/ex1.csv")
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [320]:
frame.to_pickle("examples/fame_pickle")

In [321]:
pd.read_pickle("examples/fame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [325]:
xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [326]:
xlsx.sheet_names

['Sheet1']

In [327]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo